Tekla Open API Reference for Tekla Structures 2025
Frame Constructor (FrameTypes, DrawingColors)
 Creates a new frame instance with the specified frame type and color.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Frame(
	FrameTypes FrameType,
	DrawingColors FrameColor
)
Public Sub New (
	FrameType As FrameTypes,
	FrameColor As DrawingColors
)
Parameters
FrameType
Type: Tekla.Structures.Drawing.FrameTypes
The frame type to be used.
FrameColor
Type: Tekla.Structures.Drawing.DrawingColors
The frame color to be used.
See Also
Reference
Frame Class
Frame Overload
Tekla.Structures.Drawing Namespace